{
   "Myself": [
      "Hola, I am Priyansh Vyas, residing in Bikaner, Rajasthan. You would find me at many places by the nick 'felix'.",
      "I am currently a Computer Science pre-final year student, pursuing my engineering from the BITS Pilani University.",
      "I love building stuff, and am mostly focused around web, be it's development, security or protocols.",
      "Want more details? You can connect with me via LinkedIn, GitHub or find me at @priyansh.lens."
   ],
   "Education": [
      "BITS Pilani Goa Campus [2020-24], ongoing",
      "Jesus and Mary School, Bikaner [2018-20]",
      "Delhi Public School, Bikaner [2017-18]",
      "Bikaner Boys' School [2008-17]",
      "Dayanand Public School, Bikaner [2005-08]"
   ],
   "TechStack": [
      ["React", "92%"],
      ["Vanilla JS", "80%"],
      ["Node JS", "74%"],
      ["Version Control", "70%"],
      ["Solidity", "68%"],
      ["CSS and Designing", "66%"],
      ["Python", "64%"],
      ["Rust", "62%"],
      ["Django", "58%"]
   ],
   "Experience": [
      "AUGSD Software Team Member, BITS Goa. [October 2021, ongoing]",
      "Data Science Intern, National Center for Polar and Ocean Research. [May 2022, July 2022]",
      "Senior Developer at DevSoc, BITS Goa. [November 2021, June 2022]",
      "Core Member at BITSKrieg, BITS Goa. [January 2021, May 2022]"
   ],
   "Projects": [
      "Building @niftyclick on the Solana Mobile Stack, for simplifying the NFT minting process for photographers and artists.",
      "Developed a Typescript based npm-package named 'candy-machine-assistant' to ease connecting to the Metaplex Candy Machine and sending transactions to NFT Mint Accounts on Solana.",
      "Helped build and maintain full-stack production applications like Transcript-Gradesheet Portal and Course-Feedback Software for AUGSD, BITS Goa.",
      "Full-stack Web2 and Web3 development projects made using Django/NodeJS for backend, React/NextJS for frontend and Solidity/Rust for programs residing on the blockchain.",
      "Worked with component libraries like ChakraUI, MUI, Neo-Pop Web and CSS frameworks like TailwindCSS, Bootstrap and BulmaCSS.",
      "Web scraping and vulnerability testing of SQLi and XSS using BeautifulSoup and Selenium with Python.",
      "Time-Series forecasting of Polar Temperature using the Seasonal Autoregressive Integrated Moving Average Model (SARIMA) and Extra Trees Regression."
   ],
   "Learning": [
      "Learning to master the Anchor-framework for writing Solana programs, along with understanding Seahorse-lang for simplifying the same proces.",
      "Building on Polygon, while trying to explore Zero-Knowledge architecture and building of SNARKs on the sideline.",
      "Working on improving my Rust-lang skills from time to time and solving programming problems in the same whenever possible.",
      "I also try to spend some time improving my Data Structures and Algorithms skills."
   ],
   "Achievments": [
      "I achieved an All India Rank of 3277 amongst 0.2 million eligible candidates in JEE Advanced 2020.",
      "Scored 355/450 in BITSAT-2020.",
      "Maintained a CGPA of 9.68 in my freshman year at BITS Pilani Goa Campus which led to getting awarded three consecutive Merit-based scholarships.",
      "Accomplished a Top-2 weekly rank in CryptoHack after almost 50+ hours of cryptographic exploration on RSA, Diffie-Hellman Key exchange and Elliptic Curve Cryptography."
   ],
   "Certifications": [
      "Introduction to Web Development using MERN Stack : CTE BITS Goa.",
      "JavaScript Essential Training : LinkedIn Learning.",
      "Hands-on Cybersecurity using Python : Quark BITS Goa.",
      "BugBusting re:Invent Challenge-2021 : AWS.",
      "Instructor for Advanced JavaScript and React : CTE BITS Goa.",
      "Mentor for Probability and Statistics Course : Academic Assistance Program, BITS Goa."
   ],
   "Interests": [
      "When bored, I visit solana.stackexchange to answer/get answers to my core/code related doubts of the ecosystem.",
      "I love spending my time watching Football and Formula 1 on weekends.",
      "Fanboying over Star Wars, Batman and Green Arrow. Hope that wouldn't make you judge me.",
      "Listening to the rock band Linkin Park. I have always been a huge fan.",
      "Reading documentation and articles regarding buidling on the decentralized Web, specially related to ZKP and the Solana blockchain."
   ]
}
